# Analyze Data with SQL

In this project, I am going to use a type of `SQL` to create and connect to a database, create tables, and insert values to the tables with a powerful SQLite3 module as a part of the `Python`'s standard library. SQL syntax may differ slightly depending on which `Relational Database Management Systems (RDBMS)` you are using. SQLite can store an entire database in a single file and access the database as a type of `RDBMS`. One of the most significant advantages is that all of the data can be stored locally without having to connect a database to a server. Firstly, connection will be instantiated to a database named `university` and a cursor object will be created, then tables will be described as shown below names:
- `Students`
- `Teachers`
- `Exams`

`Foreign keys` will be established to create a relationship between defined `primary` and `unique keys` which are called `referenced keys`. The variables of `exams` as a `child table` will be `referencing` on the `primary keys` of `students` and `teachers` tables as a `parent`.

In [1]:
# importing necessary libraries
import sqlite3
import pandas as pd

In [2]:
# creating and connecting to database
conn = sqlite3.connect('university.db')

In [4]:
# creating cursor object
cursor = conn.cursor()

<b> Creating Students, Teachers and Exams Tables in `university` database:

In [8]:
cursor.execute ('''CREATE TABLE students (
                                id NUMBER PRIMARY KEY,
                                name VARCHAR2(20) NOT NULL,
                                email VARCHAR2(30) NOT NULL UNIQUE,
                                major_code NUMBER,
                                grade_date DATE,
                                grade NUMBER NOT NULL)''')

In [9]:
cursor.execute('''CREATE TABLE teachers (
                                id NUMBER PRIMARY KEY,
                                name VARCHAR2(20) NOT NULL,
                                subject VARCHAR2(40),
                                age NUMBER NOT NULL)''')

In [10]:
cursor.execute('''CREATE TABLE exams (
                                student_id REFERENCES students (id) ON DELETE CASCADE,
                                teacher_id REFERENCES teachers (id) ON DELETE SET NULL)''')

<b> Tables were defined and created with `constraints` above. Now `insert into` and `executemany` statements will be used in order to insert values to the tables by using `cursor object`.

In [11]:
# inserting only a row to students table
cursor.execute('''INSERT INTO students VALUES (
                                        1, 'John', 'john@example.com', 13, '2022-06-13', 85) ''')

In [12]:
# creating students info list as a values
students_info = [(2, 'Joe', 'joe@example.com', 32, '2022-05-16', 77),
            (3, 'Stacy', 'stacy@example.com', 10, '2022-05-16', 91),
            (4, 'Adam', 'adam@example.com', 21, '2022-12-20', 94),
            (5, 'Mark', 'mark@example.com', 10, '2022-07-20', 50),
            (6, 'Nathan', 'nathan@example.com', 13, '2022-12-20', 87),
            (7, 'Alla', 'alla@example.com', 32, '2022-12-20', 66),
            (8, 'Lala', 'lala@example.com', 21, '2022-07-20', 73),
            (9, 'Tom', 'tom@example.com', 44, '2022-06-20', 51),
            (10, 'Andrew', 'andrew@example.com', 21, '2022-06-20', 87)
            ]

In [13]:
# inserting multiple values into students table at once
cursor.executemany('''INSERT INTO students VALUES (?, ?, ?, ?, ?, ?)''', students_info)

In [14]:
# inserting only a row to teachers table
cursor.execute('''INSERT INTO teachers VALUES (
                                        100, 'Jonathan', 'Data Science', 44)''')

In [15]:
# creating teachers info list as a values
teachers_info = [(101, 'Thomas', 'Information Technology', 38),
            (102, 'Bernard', 'Biology', 46),
            (103, 'Sophie', 'Geography', 32),
            (104, 'Anna', 'Physics', 53),
            (105, 'Emma', 'Chemistry', 47),
            (106,'Johnny', 'Robotics', 36),
            (107, 'James', 'Astrology', 29),
            (108, 'Ayla', 'Machine Learning', 35),
            (109, 'Jones', 'AI', 49),
            ]

In [16]:
# inserting multiple values into teachers table at once
cursor.executemany('''INSERT INTO teachers VALUES (?, ?, ?, ?)''', teachers_info)

In [17]:
# creating exams schedule list
exams_schedule = [(1, 103),
        (3, 100),
        (2, 103),
        (6, 109),
        (9, 100),
        (10, 104),
        (2, 103),
        (4, 106),
        (2, 106),
        (9, 100)]

In [18]:
# inserting values to exams table
cursor.executemany('''INSERT INTO exams VALUES (?, ?)''', exams_schedule)

<b> `University database`and `relational tables` were created above. Now the `cursor object` will be used to reach out to the `rows of tables` in a database. Then `SQLite3` `fetchone(), fetchmany(), fetchall() methods` will be used or will be looped in each table `to return to the values`.

<b> `fetchone(), fetchmany(), fetchall()` Methods:

In [19]:
# fetchone() method
cursor.execute('''SELECT * 
                  FROM students''').fetchone()

(1, 'John', 'john@example.com', 13, '2022-06-13', 85)

In [20]:
# fetchmany() method
cursor.execute('''SELECT * 
                  FROM students''').fetchmany(3)

[(1, 'John', 'john@example.com', 13, '2022-06-13', 85),
 (2, 'Joe', 'joe@example.com', 32, '2022-05-16', 77),
 (3, 'Stacy', 'stacy@example.com', 10, '2022-05-16', 91)]

In [21]:
# fetchall() method
cursor.execute('''SELECT * 
                  FROM students''').fetchall()

[(1, 'John', 'john@example.com', 13, '2022-06-13', 85),
 (2, 'Joe', 'joe@example.com', 32, '2022-05-16', 77),
 (3, 'Stacy', 'stacy@example.com', 10, '2022-05-16', 91),
 (4, 'Adam', 'adam@example.com', 21, '2022-12-20', 94),
 (5, 'Mark', 'mark@example.com', 10, '2022-07-20', 50),
 (6, 'Nathan', 'nathan@example.com', 13, '2022-12-20', 87),
 (7, 'Alla', 'alla@example.com', 32, '2022-12-20', 66),
 (8, 'Lala', 'lala@example.com', 21, '2022-07-20', 73),
 (9, 'Tom', 'tom@example.com', 44, '2022-06-20', 51),
 (10, 'Andrew', 'andrew@example.com', 21, '2022-06-20', 87)]

<b> `Loop` Method:

In [22]:
# the values of students table
for i in cursor.execute('''SELECT * 
                           FROM students'''):
    print(i)

(1, 'John', 'john@example.com', 13, '2022-06-13', 85)
(2, 'Joe', 'joe@example.com', 32, '2022-05-16', 77)
(3, 'Stacy', 'stacy@example.com', 10, '2022-05-16', 91)
(4, 'Adam', 'adam@example.com', 21, '2022-12-20', 94)
(5, 'Mark', 'mark@example.com', 10, '2022-07-20', 50)
(6, 'Nathan', 'nathan@example.com', 13, '2022-12-20', 87)
(7, 'Alla', 'alla@example.com', 32, '2022-12-20', 66)
(8, 'Lala', 'lala@example.com', 21, '2022-07-20', 73)
(9, 'Tom', 'tom@example.com', 44, '2022-06-20', 51)
(10, 'Andrew', 'andrew@example.com', 21, '2022-06-20', 87)

In [23]:
# the values of teachers table
for j in cursor.execute('''SELECT * 
                           FROM teachers'''):
    print(j)

(100, 'Jonathan', 'Data Science', 44)
(101, 'Thomas', 'Information Technology', 38)
(102, 'Bernard', 'Biology', 46)
(103, 'Sophie', 'Geography', 32)
(104, 'Anna', 'Physics', 53)
(105, 'Emma', 'Chemistry', 47)
(106, 'Johnny', 'Robotics', 36)
(107, 'James', 'Astrology', 29)
(108, 'Ayla', 'Machine Learning', 35)
(109, 'Jones', 'AI', 49)

In [24]:
# the values of exams table
for k in cursor.execute('''SELECT * 
                           FROM exams'''):
    print(k)

(1, 103)
(3, 100)
(2, 103)
(6, 109)
(9, 100)
(10, 104)
(2, 103)
(4, 106)
(2, 106)
(9, 100)

<b> Then all values can be `manipulated` to access, create and update data stored in a database. Additionally, more complex queries can be run using types of statements as ` Data Manipulation Language (DML)`,  `Data Definition Language (DDL)`, `Transaction Control Language (TCL)`.

In [25]:
# using alter DDL
cursor.execute('''ALTER TABLE teachers
                  ADD COLUMN city varchar2(20)''')

In [26]:
# Changes on teachers table after using DDL
cursor.execute('''SELECT * 
                  FROM teachers''').fetchmany(3)

[(100, 'Jonathan', 'Data Science', 44, None),
 (101, 'Thomas', 'Information Technology', 38, None),
 (102, 'Bernard', 'Biology', 46, None)]

In [27]:
# using update DML
cursor.execute('''UPDATE teachers
                  SET city = 'Berlin'
                  WHERE id BETWEEN 103 AND 106''')

In [28]:
cursor.execute('''SELECT * 
                  FROM teachers 
                  LIMIT 8''').fetchall()

[(100, 'Jonathan', 'Data Science', 44, None),
 (101, 'Thomas', 'Information Technology', 38, None),
 (102, 'Bernard', 'Biology', 46, None),
 (103, 'Sophie', 'Geography', 32, 'Berlin'),
 (104, 'Anna', 'Physics', 53, 'Berlin'),
 (105, 'Emma', 'Chemistry', 47, 'Berlin'),
 (106, 'Johnny', 'Robotics', 36, 'Berlin'),
 (107, 'James', 'Astrology', 29, None)]

In [29]:
cursor.execute('''SELECT * 
                  FROM students
                  WHERE id = 5''')

In [30]:
cursor.execute('''DELETE FROM students
                  WHERE id = 5''')

In [31]:
for rows in cursor.execute('''SELECT * 
                              FROM students
                              WHERE name LIKE '%J%'
                                  OR grade > 90'''):
    print(rows)

(1, 'John', 'john@example.com', 13, '2022-06-13', 85)
(2, 'Joe', 'joe@example.com', 32, '2022-05-16', 77)
(3, 'Stacy', 'stacy@example.com', 10, '2022-05-16', 91)
(4, 'Adam', 'adam@example.com', 21, '2022-12-20', 94)

In [32]:
# using case statement
for rows in cursor.execute('''SELECT *,
                                  CASE
                                      WHEN students.grade < 51 THEN 'Failed'
                                      WHEN students.grade < 81 THEN 'Good'
                                      ELSE 'Excellent' 
                                  END AS 'grade_check'
                              FROM students'''
                          ):
    print(rows)

(1, 'John', 'john@example.com', 13, '2022-06-13', 85, 'Excellent')
(2, 'Joe', 'joe@example.com', 32, '2022-05-16', 77, 'Good')
(3, 'Stacy', 'stacy@example.com', 10, '2022-05-16', 91, 'Excellent')
(4, 'Adam', 'adam@example.com', 21, '2022-12-20', 94, 'Excellent')
(6, 'Nathan', 'nathan@example.com', 13, '2022-12-20', 87, 'Excellent')
(7, 'Alla', 'alla@example.com', 32, '2022-12-20', 66, 'Good')
(8, 'Lala', 'lala@example.com', 21, '2022-07-20', 73, 'Good')
(9, 'Tom', 'tom@example.com', 44, '2022-06-20', 51, 'Good')
(10, 'Andrew', 'andrew@example.com', 21, '2022-06-20', 87, 'Excellent')

In [33]:
# using group by clause
for rows in cursor.execute('''SELECT id, major_code
                              FROM students
                              GROUP BY id, major_code
                              ORDER BY major_code DESC'''):
    print(rows)

(9, 44)
(2, 32)
(7, 32)
(4, 21)
(8, 21)
(10, 21)
(1, 13)
(6, 13)
(3, 10)

In [34]:
# group by, having and sum clauses
for rows in cursor.execute('''SELECT major_code, SUM (grade) AS total_grade
                              FROM students
                              GROUP BY major_code
                              HAVING total_grade >51'''
                          ):
    print(rows)

(10, 91)
(13, 172)
(21, 254)
(32, 143)

In [35]:
# checking teachers table after all manipulations
cursor.execute('''SELECT * 
                  FROM teachers''').fetchall()

[(100, 'Jonathan', 'Data Science', 44, None),
 (101, 'Thomas', 'Information Technology', 38, None),
 (102, 'Bernard', 'Biology', 46, None),
 (103, 'Sophie', 'Geography', 32, 'Berlin'),
 (104, 'Anna', 'Physics', 53, 'Berlin'),
 (105, 'Emma', 'Chemistry', 47, 'Berlin'),
 (106, 'Johnny', 'Robotics', 36, 'Berlin'),
 (107, 'James', 'Astrology', 29, None),
 (108, 'Ayla', 'Machine Learning', 35, None),
 (109, 'Jones', 'AI', 49, None)]

In [36]:
# checking students table after all manipulations
cursor.execute('''SELECT * 
                  FROM students''').fetchall()

[(1, 'John', 'john@example.com', 13, '2022-06-13', 85),
 (2, 'Joe', 'joe@example.com', 32, '2022-05-16', 77),
 (3, 'Stacy', 'stacy@example.com', 10, '2022-05-16', 91),
 (4, 'Adam', 'adam@example.com', 21, '2022-12-20', 94),
 (6, 'Nathan', 'nathan@example.com', 13, '2022-12-20', 87),
 (7, 'Alla', 'alla@example.com', 32, '2022-12-20', 66),
 (8, 'Lala', 'lala@example.com', 21, '2022-07-20', 73),
 (9, 'Tom', 'tom@example.com', 44, '2022-06-20', 51),
 (10, 'Andrew', 'andrew@example.com', 21, '2022-06-20', 87)]

<b> In order to store data efficiently, we often spread related information across `multiple tables`. Combining tables manually is time-consuming. Luckily, SQL gives us an easy sequence that is called a `JOIN`. Let's combine the `exams` table with `students` and `teachers` tables below using `Join (Inner Join)`, `Left Join (Outer)` and `Cross Join`.

In [37]:
# Join or Inner Join 
for rows in cursor.execute('''SELECT *
                              FROM teachers 
                              INNER JOIN exams
                                  ON teachers.id = exams.teacher_id'''
                          ):
    print(rows)

(103, 'Sophie', 'Geography', 32, 'Berlin', 1, 103)
(100, 'Jonathan', 'Data Science', 44, None, 3, 100)
(103, 'Sophie', 'Geography', 32, 'Berlin', 2, 103)
(109, 'Jones', 'AI', 49, None, 6, 109)
(100, 'Jonathan', 'Data Science', 44, None, 9, 100)
(104, 'Anna', 'Physics', 53, 'Berlin', 10, 104)
(103, 'Sophie', 'Geography', 32, 'Berlin', 2, 103)
(106, 'Johnny', 'Robotics', 36, 'Berlin', 4, 106)
(106, 'Johnny', 'Robotics', 36, 'Berlin', 2, 106)
(100, 'Jonathan', 'Data Science', 44, None, 9, 100)

In [38]:
# Left or Outer Join
for rows in cursor.execute('''SELECT *
                              FROM exams
                              LEFT JOIN students
                                  ON exams.student_id = students.id'''):
    print(rows)

(1, 103, 1, 'John', 'john@example.com', 13, '2022-06-13', 85)
(3, 100, 3, 'Stacy', 'stacy@example.com', 10, '2022-05-16', 91)
(2, 103, 2, 'Joe', 'joe@example.com', 32, '2022-05-16', 77)
(6, 109, 6, 'Nathan', 'nathan@example.com', 13, '2022-12-20', 87)
(9, 100, 9, 'Tom', 'tom@example.com', 44, '2022-06-20', 51)
(10, 104, 10, 'Andrew', 'andrew@example.com', 21, '2022-06-20', 87)
(2, 103, 2, 'Joe', 'joe@example.com', 32, '2022-05-16', 77)
(4, 106, 4, 'Adam', 'adam@example.com', 21, '2022-12-20', 94)
(2, 106, 2, 'Joe', 'joe@example.com', 32, '2022-05-16', 77)
(9, 100, 9, 'Tom', 'tom@example.com', 44, '2022-06-20', 51)

In [39]:
# Cross Join
cursor.execute('''SELECT *
                  FROM students
                  CROSS JOIN exams'''
               )

<b>  Lastly, the `.commit()` clause will be used to commit changes to the database. Then connection to the database will be closed using the `.close()` clause.

In [40]:
#Commit changes to database
conn.commit()

In [41]:
# Closing the connection
conn.close()

<b> Ultimately, `Python`'s powerful library `pandas` will be used to convert `DataFrame` to a new table by creating a `new database` named `sample` with the `df_to_sql()` method. SQL manipulations, functions can be made with the newly created `titanic table` again. For this method, `titanic.csv` data will be used by reading in a dataframe below.

In [42]:
# importing data to DataFrame
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [44]:
# reading first five rows in a dataset
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [45]:
# instantiate connection to database
con = sqlite3.connect('sample.db')

In [46]:
# creating cursor object
cursor = con.cursor()

In [49]:
# creating a new titanic table in sample database
df.to_sql('titanic', con)

In [50]:
# defining empty list
lst = []
# looping in titanic table and appending new list
for rows in cursor.execute('''SELECT * 
                              FROM titanic'''
                          ):
    lst.append(rows)

In [53]:
# checking some values in list
lst[0:3]

[(0,
  1,
  0,
  3,
  'Braund, Mr. Owen Harris',
  'male',
  22.0,
  1,
  0,
  'A/5 21171',
  7.25,
  None,
  'S'),
 (1,
  2,
  1,
  1,
  'Cumings, Mrs. John Bradley (Florence Briggs Thayer)',
  'female',
  38.0,
  1,
  0,
  'PC 17599',
  71.2833,
  'C85',
  'C'),
 (2,
  3,
  1,
  3,
  'Heikkinen, Miss. Laina',
  'female',
  26.0,
  0,
  0,
  'STON/O2. 3101282',
  7.925,
  None,
  'S')]

In [54]:
cursor.execute('''SELECT * 
                  FROM titanic
                  WHERE PassengerId = 5''').fetchall()

[(4,
  5,
  0,
  3,
  'Allen, Mr. William Henry',
  'male',
  35.0,
  0,
  0,
  '373450',
  8.05,
  None,
  'S')]

In [55]:
cursor.execute('''SELECT Cabin 
                  FROM titanic
                  GROUP BY Cabin
                  LIMIT 10
                  ''').fetchall()

[(None,),
 ('A10',),
 ('A14',),
 ('A16',),
 ('A19',),
 ('A20',),
 ('A23',),
 ('A24',),
 ('A26',),
 ('A31',)]

In [56]:
cursor.execute('''SELECT
                      AVG (Fare) 
                  FROM titanic
                  ''').fetchall()

[(32.2042079685746,)]

In [57]:
cursor.execute('''SELECT
                      AVG (Age) 
                  FROM titanic
                  ''').fetchall()

[(29.69911764705882,)]

In [58]:
#Commit changes to database
con.commit()

In [60]:
# Closing the connection
con.close()

<b>In conclusion, Relational databases store data in tables. Tables can grow large and have a multitude of columns and records. Relational database management systems (RDBMS) use SQL (and different types of SQL) to access and manage the data in these large tables.